CSI API ETABS v1

# cDesignSteelItalian_NTC_2018 Property

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    cDStItalianNTC2018S Italian_NTC_2018 { get; }

    ReadOnly Property Italian_NTC_2018 As cDStItalianNTC2018S
    	Get

    Dim instance As cDesignSteel
    Dim value As cDStItalianNTC2018S

    value = instance.Italian_NTC_2018

    property cDStItalianNTC2018S^ Italian_NTC_2018 {
    	cDStItalianNTC2018S^ get ();
    }

    abstract Italian_NTC_2018 : cDStItalianNTC2018S with get

#### Property Value

Type: cDStItalianNTC2018S

See Also

#### Reference

cDesignSteel Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com